---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWallError
source: html/03d57de0-5d90-09fd-1ba8-7f71d2300639.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWallError Property

Cannot create wall - it would intersect itself. Reduce the wall's height or slant.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawSingularSlantedWallError { get; }
```